namespace LoanSystemAvizhe.Services.Sms.Models.WebOne;

public class SendWebOneResult
{
    public bool Succeeded { get; set; }

    public long RefId { get; set; }

    public int ResultCode { get; set; }

    public string ResultMessage => ResultCode switch
    {
        0 => "موفق",
        1 => "نام کاربری یا کلمه عبور صحیح نمی باشد",
        2 => "حساب کاربری پیامک مسدود شده است",
        3 => "شماره فرستنده نامعتبر است",
        4 => "محدودیت در ارسال روزانه",
        5 => "تعداد گیرندگان حداکثر 100 شماره می باشد",
        6 => "خط فرستنده غیرفعال است",
        7 => "متن پیامک سامل کلمات فیلتر شده است",
        8 => "اعتبار کافی نیست",
        9 => "سامانه در حال بروز رسانی است",
        10 => "وب سرویس غیرفعال است",
        14 => "کاربر فاقد تعرفه می باشد",
        15 => "ارسال تكراري متن مشابه به شماره مشابه در مدت زمان مشخص",
        16 => "شماره موبايل گيرنده يافت نشد",
        17 => "خط OTP براي كاربر يافت نشد",
        18 => "با اين شماره فقط ارسال تكی مجاز است",
        19 => "متن ارسالي شما با الگوي تعريفي شما مطابقت ندارد",
        21 => "آي پي شما براي ارسال از وب سرويس مجاز نمي باشد",
        22 => "عدم تاييد يا ارسال كارت ملي كاربر",
        _ => "",
    };
}
